CSI API ETABS v1

# cSapModelPointObj Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPointObj PointObj { get; }

    ReadOnly Property PointObj As cPointObj
    	Get

    Dim instance As cSapModel
    Dim value As cPointObj

    value = instance.PointObj

    property cPointObj^ PointObj {
    	cPointObj^ get ();
    }

    abstract PointObj : cPointObj with get

#### Property Value

Type: cPointObj

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com